import logo from "./logo.svg";
import React from "react";
import "./App.css";
import DialogeBox from "./Components/DialogeBox/DialogeBox";
import SideBarMessages from "./Sidebar/SideBarMessages";
import MessagePlace from "./Message/MessagePlace";
import Memes from "./Additional/Memes";

export default function App() {
  const messages = [
    {
      name: "Коля Оторва",
      description:
        "Представляешь, чуть под поезд не попал! Жизнь со мной не соскучится, видимо. Ну, как говорится, живём на адреналине!",
      image: "",
    },
    {
      name: "Семен Сергеевич",
      description:
        "Вот уж день! Еду я на своём поезде, а какой-то сорвиголова перебегает прямо передо мной. Ещё чуть-чуть — и катастрофа! Никогда такого не видел.",
      image: "",
    },
    {
      name: "Бабушка Лидия",
      description:
        "Игорёк, ты осторожнее будь! Страшно за тебя, на улицах сейчас много лихачей. Не ходи по дороге, как в детстве!",
      image: "",
    },
    {
      name: "Иван Зверев",
      description:
        "Ты не поверишь! Пытался пересечь железку, и вдруг поезд из-за поворота. Холодок по спине пробежал! Вот это экстрим.",
      image: "",
    },
    {
      name: "Андрей Павлович",
      description:
        "Смену веду, а тут на путях чудо появилось, прямо перед поездом. Думаю, вот наслоение приключений! Лет двадцать такое не видел.",
      image: "",
    },
    {
      name: "Оксана",
      description:
        "Игорь, смотри на дорогу, пожалуйста! Ты у нас ещё молодой, держи голову на плечах. Мы за тебя всегда переживаем.",
      image: "",
    },
    {
      name: "Даня",
      description:
        "Чел, ты просто не представляешь! Поезд чуть не снёс меня на повороте. Вот это день! Можешь меня звать супергероем теперь, я выжил!",
      image: "",
    },
    {
      name: "Лариса Петровна",
      description:
        "Работаю машинистом столько лет, но таких экстремалов ещё не видела! Как-то на сегодня с меня приключений достаточно.",
      image: "",
    },
    {
      name: "Папа",
      description:
        "Ну ты у меня и сорвиголова, Игорь! Но давай всё-таки чуть поосторожнее, ладно? Мне важно, чтобы ты был жив-здоров.",
      image: "",
    },
    {
      name: "Коля Оторва",
      description:
        "Представляешь, чуть под поезд не попал! Жизнь со мной не соскучится, видимо. Ну, как говорится, живём на адреналине!",
      image: "",
    },
    {
      name: "Семен Сергеевич",
      description:
        "Вот уж день! Еду я на своём поезде, а какой-то сорвиголова перебегает прямо передо мной. Ещё чуть-чуть — и катастрофа! Никогда такого не видел.",
      image: "",
    },
    {
      name: "Бабушка Лидия",
      description:
        "Игорёк, ты осторожнее будь! Страшно за тебя, на улицах сейчас много лихачей. Не ходи по дороге, как в детстве!",
      image: "",
    },
    {
      name: "Иван Зверев",
      description:
        "Ты не поверишь! Пытался пересечь железку, и вдруг поезд из-за поворота. Холодок по спине пробежал! Вот это экстрим.",
      image: "",
    },
    {
      name: "Андрей Павлович",
      description:
        "Смену веду, а тут на путях чудо появилось, прямо перед поездом. Думаю, вот наслоение приключений! Лет двадцать такое не видел.",
      image: "",
    },
    {
      name: "Оксана",
      description:
        "Игорь, смотри на дорогу, пожалуйста! Ты у нас ещё молодой, держи голову на плечах. Мы за тебя всегда переживаем.",
      image: "",
    },
    {
      name: "Даня",
      description:
        "Чел, ты просто не представляешь! Поезд чуть не снёс меня на повороте. Вот это день! Можешь меня звать супергероем теперь, я выжил!",
      image: "",
    },
    {
      name: "Лариса Петровна",
      description:
        "Работаю машинистом столько лет, но таких экстремалов ещё не видела! Как-то на сегодня с меня приключений достаточно.",
      image: "",
    },
    {
      name: "Папа",
      description:
        "Ну ты у меня и сорвиголова, Игорь! Но давай всё-таки чуть поосторожнее, ладно? Мне важно, чтобы ты был жив-здоров.",
      image: "",
    },
  ];

  return (
    <div className="border-4 border-pink-500">
      <div className="flex gap-1 h-screen bg-gradient-to-t from-pink-500  to-indigo-600">
        <SideBarMessages messages={messages} />
        <MessagePlace></MessagePlace>
        <Memes></Memes>
      </div>
      </div>
  );
}
